Revit 2026 API

# FamilySymbolProfileProfile Property

---

Returns the family symbol of the profile.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilySymbol Profile { get; set; }
```
```vb
Public Property Profile As FamilySymbol
	Get
	Set
```
```cpp
public:
property FamilySymbol^ Profile {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
```
```fsharp
member Profile : FamilySymbol with get, set
```

#### Property Value

FamilySymbol

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the argument is . |
| ArgumentException | Thrown when the category of argument is not BuiltInCategory.OST_ProfileFamilies. |

The symbol must of the category BuiltInCategory.OST_ProfileFamilies.

#### Reference

FamilySymbolProfile Class

Autodesk.Revit.DB Namespace